/*=============================================================================

	tagname.C : 見出しパネルのサンプル 見出し文字列の定義

	(C) Copyright 1999 Personal Media Corporation

=============================================================================*/
#include	"tagsamp.h"

/*=========================================================見出し文字列の設定*/
LOCAL	TC	page11[] = {L"＠親ページ１", L"子ページ１１"};
LOCAL	TC	page12[] = {L"＋子ページ１２"};
LOCAL	TC	page21[] = {L"親ページ２"};
LOCAL	TC	page31[] = {L"親ページ３"};

/*=================================================見出し文字列テーブルの設定*/
EXPORT	VP	pnl_tbl[MAX_SUBPNL] = {
			page11, page12, page21, page31
		};
