----------------------------------------------------------------------
--	tagsamp1.d : 見出しパネルサンプル データボックス定義
--
--	(C) Copyright 1999 by Personal Media Corporation
----------------------------------------------------------------------

        {% USER_DATA:L   0L        }     -- データタイプ = 64
        {# 0x2000L       0L      0L}      -- データ番号

-- 標準定数定義
#include <stddef.d>

----------------------------------------------------------------------
-- データ参照テーブル
----------------------------------------------------------------------
.BASE = 0L

	DATA_END/4			-- データ・エントリワード数

	-- 標準パネルデータ定義
	SPNL+0		epnl_wind	-- 一般エラー
	SPNL+1		epnl_menu
	SPNL+2		epnl_memory
	SPNL+3		epnl_system
	SPNL+4		epnl_osta

	-- メニューデータ定義
	MENU+0		ts_menu

	-- 文字列バッファ定義
	PSTR+0		str_buf1

	-- その他のデータ定義
	MISC+0		ts_title
	MISC+1		ts_windsz

	MISC+10		ts_def

	MISC+50		win_def

.DATA_END:

-- アプリケーションライブラリのデータ定義
#include <libapp.d>

----------------------------------------------------------------------
-- スイッチ定義
----------------------------------------------------------------------
.BASE = 0H

--------------------
.sw_cnfm:	MS_PARTS	{0+CU 0 88 24}		0L	OFFSET:L+4
		MC_STR	"確認\0"

----------------------------------------------------------------------
-- パネル定義
----------------------------------------------------------------------
.BASE = 0L
.str_buf1:	""21

--------------------
.str_wind:	"ウィンドウが開けませんので終了します。\0"
.epnl_wind:	TEXT+pMID+pERR				str_wind
		TEXT+pMID+pINE				err_dmy
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_menu:	"メニューが登録できませんので終了します。\0"
.epnl_menu:	TEXT+pMID+pERR				str_menu
		TEXT+pMID+pINE				err_dmy
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_memory:	"メモリが不足しましたので処理を中断します。\0"
.epnl_memory:	TEXT+pMID+pERR				str_memory
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_system:	"システムに障害が発生しました。\0"
.epnl_system:	TEXT+pMID+pERR				str_system
		TEXT+pMID+pINE				err_dmy
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_osta:	"仮身の実行処理ができません。\0"
.epnl_osta:	TEXT+pMID+pERR				str_osta
		TEXT+pMID+pINE				err_dmy
		PART+pMID+pDEF+pEND			sw_cnfm

----------------------------------------------------------------------
-- メニューデータ定義
----------------------------------------------------------------------
-- メニュー項目定義
.BASE = 0L

.ts_menu:	ts_cnv			-- 変換テーブルオフセット
		0			-- 表示属性オフセット
		mitem_0			-- 終了
		mitem_1			-- ………………
		MN_WINDOW		-- ウィンドウ
		MN_TOOL			-- 小物
		0

-- メニュー項目リスト
.BASE = 0H

.mitem_0:	MC_STRKEY1	"Ｅ"		"終了"
		0

.mitem_1:	MC_LINE
		0


-- メニュー項目番号変換テーブル
.BASE = 0L
--		実番号	内部番号	パラメータ
.ts_cnv:	0x001	0		0	-- [終了]
		0				-- テーブル終了

----------------------------------------------------------------------
-- その他のデータ
----------------------------------------------------------------------
.BASE = 0H

-- ウィンドウタイトル
.ts_title:	"見出しパネルサンプル１\0"

-- ウィンドウ全体サイズ
.ts_windsz:	0	0	400	300

----------------------------------------------------------------------
-- 画面定義 (このサンプルでは使用していない)
----------------------------------------------------------------------
.BASE = 0H

.ts_def:	0

.win_def:	0


