----------------------------------------------------------------------
-- TXED 付箋 : databox プログラムで処理
----------------------------------------------------------------------
	0 0 0 0					-- r
	16					-- chsz
	0x10000000L 0x10000000L 0x10FFFFFFL	-- colors
	4					-- pict
	0x8000	0x0003	0x8000			-- apl-id
	"基本文章編集"16			-- name
	"文章"16				-- type
	32					-- dlen
	------ 固有データ ------
	0x0000					-- 表示モード(全画面)
	0					-- 倍率(未使用)
	0 0 640 380				-- ウィンドウ外枠
	0					-- 表示オフセット(X)
	0L					-- 表示オフセット(Y)
	0					-- ウィンドウ作業領域幅
	0					-- 背景マスク(仮身背景)
	0x10FFFFFFL				-- 背景色
	0 0					-- 検索置換パネル左上座標
	0					-- 予約
----------------------------------------------------------------------
