----------------------------------------------------------------------
--	tagsamp2.d : 見出しパネルサンプル データボックス定義
--
--	(C) Copyright 1999 by Personal Media Corporation
----------------------------------------------------------------------

        {% USER_DATA:L   0L        }      -- データタイプ = 64
        {# 0x2000L       0L      0L}      -- データ番号

-- 標準定数定義
#include <stddef.d>

----------------------------------------------------------------------
-- データ参照テーブル
----------------------------------------------------------------------
.BASE = 0L

	DATA_END/4			-- データ・エントリワード数

	-- 標準パネルデータ定義
	SPNL+0		epnl_wind	-- 一般エラー
	SPNL+1		epnl_menu
	SPNL+2		epnl_memory
	SPNL+3		epnl_system
	SPNL+4		epnl_osta
	SPNL+5		pnl_test

	-- メニューデータ定義
	MENU+0		ts_menu

	-- 文字列バッファ定義
	PSTR+0		str_buf1

	-- その他のデータ定義
	MISC+0		ts_title
	MISC+1		ts_windsz

	MISC+10		ts_def

	MISC+50		win_def

.DATA_END:

-- アプリケーションライブラリのデータ定義
#include <libapp.d>

----------------------------------------------------------------------
-- スイッチ定義
----------------------------------------------------------------------
.BASE = 0H

--------------------
.sw_cnfm:	MS_PARTS	{0+CU 0 88 24}		0L	OFFSET:L+4
		MC_STR	"確認\0"

----------------------------------------------------------------------
-- パネル定義
----------------------------------------------------------------------
.BASE = 0L
.str_buf1:	""21

--------------------
.str_wind:	"ウィンドウが開けませんので終了します。\0"
.epnl_wind:	TEXT+pMID+pERR				str_wind
		TEXT+pMID+pINE				err_dmy
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_menu:	"メニューが登録できませんので終了します。\0"
.epnl_menu:	TEXT+pMID+pERR				str_menu
		TEXT+pMID+pINE				err_dmy
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_memory:	"メモリが不足しましたので処理を中断します。\0"
.epnl_memory:	TEXT+pMID+pERR				str_memory
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_system:	"システムに障害が発生しました。\0"
.epnl_system:	TEXT+pMID+pERR				str_system
		TEXT+pMID+pINE				err_dmy
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_osta:	"仮身の実行処理ができません。\0"
.epnl_osta:	TEXT+pMID+pERR				str_osta
		TEXT+pMID+pINE				err_dmy
		PART+pMID+pDEF+pEND			sw_cnfm
--------------------
.str_test:	"テスト\0"
.pnl_test:	TEXT+pMID				str_test
		PART+pMID+pDEF+pEND			sw_cnfm

----------------------------------------------------------------------
-- メニューデータ定義
----------------------------------------------------------------------
-- メニュー項目定義
.BASE = 0L

.ts_menu:	ts_cnv			-- 変換テーブルオフセット
		0			-- 表示属性オフセット
		mitem_0			-- 終了
		mitem_1			-- 操作
		mitem_2			-- ………………
		MN_WINDOW		-- ウィンドウ
		MN_TOOL			-- 小物
		0

-- メニュー項目リスト
.BASE = 0H

.mitem_0:	MC_STRKEY1	"Ｅ"		"終了"
		0

.mitem_1:	MC_STR				"操作"
		MC_STR				"ダミー"
		MC_STRKEY1	"Ｔ"		"テスト"
		0

.mitem_2:	MC_LINE
		0

-- メニュー項目番号変換テーブル
.BASE = 0L
--		実番号	内部番号	パラメータ
.ts_cnv:	0x001	0		0	-- [終了]
		0x101	1		1	-- [操作] - [ダミー]
		0x102	1		2	-- [操作] - [テスト]
		0				-- テーブル終了

----------------------------------------------------------------------
-- その他のデータ
----------------------------------------------------------------------
.BASE = 0H

-- ウィンドウタイトル
.ts_title:	"見出しパネルサンプル２\0"

-- ウィンドウ全体サイズ
.ts_windsz:	0	0	400	300

----------------------------------------------------------------------
-- 画面定義
----------------------------------------------------------------------
.BASE = 0H

.ch = 16
.cw = 16
.hs = 8
.he = hs+364
.vs = 8
.ve = vs+196
.vsn = ch+32

.ts_def:	page11				-- 見出しパネルのテーブル
		page12
		page21
		page31

.win_def:	0

----------------------------------------------------------------------
-- [ページ１] - [ページ１１]
----------------------------------------------------------------------
.page11:	tl_page11			-- タイトル
		sw1_page11
		sw2_page11
		sw3_page11
		0				-- パーツ終了
		st1_page11	{hs 	ch+vsn   }
		st2_page11	{hs	ch+vsn+32}
		st3_page11	{hs	ch+vsn+64}
		0				-- 文字列終了

.tl_page11:	"＠ページ１\0ページ１１\0"

.st1_page11:	"ボタンその１：\0"
.sw1_page11:	MS_PARTS	{hs+112	vsn	hs+192	vsn+24}
		1L	OFFSET:L+4
		MC_STR	"ダミー１"
		0

.st2_page11:	"ボタンその２：\0"
.sw2_page11:	MS_PARTS	{hs+112	vsn+32	hs+192	vsn+56}
		1L	OFFSET:L+4
		MC_STR	"ダミー２"
		0

.st3_page11:	"ボタンその３：\0"
.sw3_page11:	MS_PARTS	{hs+112	vsn+64	hs+192	vsn+88}
		1L	OFFSET:L+4
		MC_STR	"ダミー３"
		0

----------------------------------------------------------------------
-- [ページ１] - [ページ１２]
----------------------------------------------------------------------
.page12:	tl_page12			-- タイトル
--		tb1_page12
		0				-- パーツ終了
		0				-- 文字列終了

.tl_page12:	"＋ページ１２\0"

.tb1_area:	""21
.tb1_page12:	TB_PARTS	{hs	vs+64	hs+112	vs+88}
		20L	tb1_area:L
		0

----------------------------------------------------------------------
-- [ページ２]
----------------------------------------------------------------------
.page21:	tl_page21			-- タイトル
		0				-- パーツ終了
		0				-- 文字列終了

.tl_page21:	"ページ２\0"

----------------------------------------------------------------------
-- [ページ３]
----------------------------------------------------------------------
.page31:	tl_page31			-- タイトル
		0				-- パーツ終了
		0				-- 文字列終了

.tl_page31:	"ページ３\0"

----------------------------------------------------------------------
